Repository: AntoineNeowave/NEW_APP_QT_OTP
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fr

source: Command executed successfully
fr: Commande exécutée avec succès

source: Command not recognized
fr: Commande non reconnue

source: The command contains invalid CBOR encoding
fr: La commande contient un encodage CBOR invalide

source: Unrecognized OTP command
fr: Commande OTP inconnue

source: Invalid parameter in command
fr: Paramètre invalide dans la commande

source: A generator with this name already exists
fr: Un générateur avec ce nom existe déjà

source: Generator not found
fr: Générateur non trouvé

source: Memory full, unable to create another generator
fr: Mémoire pleine, impossible de créer un autre générateur

source: Unknown error 0x{code:02X}
fr: Erreur inconnue 0x{code:02X}

source: Undocumented error
fr: Erreur non documentée

source: ⚠️ No OTP Device detected.
fr: ⚠️ Aucun périphérique OTP détecté.

source: Device communication error
fr: Erreur de communication avec le périphérique

source: Account : {account}
fr: Compte : {account}

source: Issuer: {issuer}
fr: Émetteur : {issuer}

source: Code length: {digits}
fr: Longueur du code : {digits}

source: Counter: {counter}
fr: Compteur : {counter}

source: Timestep: {period} seconds
fr: Durée : {period} secondes

source: Unknown ({alg})
fr: Inconnu ({alg})

source: Algorithm: {algo}
fr: Algorithme : {algo}

source: Device not detected
fr: Périphérique non détecté

source: CTAP error
fr: Erreur CTAP

source: Error
fr: Erreur

source: Enroll OTP secret
fr: Enregistrer un secret OTP

source: Add OTP Account
fr: Ajouter un compte OTP

source: Issuer :
fr: Émetteur :

source: Issuer name should not contain ':'
fr: Le nom de l'émetteur ne doit pas contenir ':'

source: Account name <span style='color:red'>*</span> :
fr: Nom du compte <span style='color:red'>*</span> :

source: user@example.com
fr: utilisateur@exemple.com

source: Account name should not contain ':'
fr: Le nom du compte ne doit pas contenir ':'

source: Secret key (Base32) <span style='color:red'>*</span> :
fr: Clé secrète (Base32) <span style='color:red'>*</span> :

source: Generate a random seed
fr: Générer une graine aléatoire

source: Advanced options
fr: Options avancées

source: OTP Type :
fr: Type OTP :

source: Algorithm :
fr: Algorithme :

source: Number of digits :
fr: Nombre de chiffres :

source: Timestep (seconds) :
fr: Durée (secondes) :

source: Add account
fr: Ajouter le compte

source: Account name is required
fr: Le nom du compte est requis

source: Secret key is required
fr: La clé secrète est requise

source: Secret key must be a valid Base32 string
fr: La clé secrète doit être une chaîne Base32 valide

source: Invalid seed length: {length_error}
fr: Longueur de graine invalide : {length_error}

source: Invalid Base32 encoding: {error}
fr: Encodage Base32 invalide : {error}

source: Initial counter :
fr: Compteur initial :

source: Unknown algorithm: {algo}
fr: Algorithme inconnu : {algo}

source: Secret key too short for {algo}: {length} bytes (minimum: {min_accepted})
fr: Clé secrète trop courte pour {algo} : {length} octets (minimum : {min_accepted})

source: Secret key too long for {algo}: {length} bytes (maximum: {max})
fr: Clé secrète trop longue pour {algo} : {length} octets (maximum : {max})

source: Account name is required.
fr: Le nom du compte est requis.

source: Secret key is required.
fr: La clé secrète est requise.

source: Secret key must be a valid Base32 string.
fr: La clé secrète doit être une chaîne Base32 valide.

source: Secret key validation failed: {error_msg}
fr: Échec de validation de la clé secrète : {error_msg}

source: Unknown error
fr: Erreur inconnue

source: OTP Error
fr: Erreur OTP

source: Search for a code...
fr: Rechercher un code...

source: Device disconnected
fr: Périphérique déconnecté

source: Device unplugged
fr: Périphérique débranché

source: Delete {account}
fr: Supprimer {account}

source: Are you sure you want to delete the OTP generator '{account}'?
fr: Êtes-vous sûr de vouloir supprimer le générateur OTP '{account}' ?

source: Deletion of '{label}' failed
fr: Échec de la suppression de '{label}'

source: Copy code to clipboard
fr: Copier le code dans le presse-papiers

source: Code copied
fr: Code copié

source: Show OTP parameters
fr: Afficher les paramètres

source: Delete OTP account
fr: Supprimer le compte

source: Delete OTP code
fr: Supprimer le code OTP

source: Disconnected
fr: Déconnecté
